Wanted to give an update.  It really is strange because during the planning it does pull the org_id and billing_account id as you can see in the below output.  It will not however work unless I hardcode those two items.  So the credential file isn't changing but if those two items are hardcoded and not variables it all works fine.

  # google_project.prod_service_project_1 will be created
  + resource "google_project" "prod_service_project_1" {
      + app_engine          = (known after apply)
      + auto_create_network = true
      + billing_account     = "013DB0-593538-8285A7"
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "something-devops"
      + number              = (known after apply)
      + org_id              = "694473993971"
      + policy_data         = (known after apply)
      + policy_etag         = (known after apply)
      + project_id          = "something-devops-ac17"
      + skip_delete         = (known after apply)